/datum/heretic_knowledge/limited_amount/starting/base_rust
	name = "Blacksmith's Tale"
	desc = "Открывает Путь Ржавчины. \
		Позволяет преобразовать нож и любой мусорный предмет в Ржавый Клинок. \
		Можно создать только два клинка одновременно."
	gain_text = "\"Позвольте рассказать вам историю\", промолвил Кузнец, вглядываясь в свой ржавый клинок."

/datum/heretic_knowledge/rust_fist
	name = "Grasp of Rust"
	desc = "Хватка Мансуса наносит 500 урона неживой материи и ржавеет любую поверхность при касании. \
		Уже проржавевшие поверхности разрушаются. Для ржавления поверхностей и структур необходимо использовать ПКМ. \
		Позволяет ржаветь базовые железные стены и полы."
	gain_text = "Потолок Мансуса медленно покрывается ржавчиной — словно камень, захваченный ползучим мхом!"

/datum/heretic_knowledge/rust_regen
	name = "Leeching Walk"
	desc = "Дарует пассивное лечение и устойчивость к дубинкам при нахождении на ржавых поверхностях."
	gain_text = "Такой скорости мир ещё не видел! Такой силы природа не знала! А Кузнец... Кузнец лишь ухмылялся в тени."

/datum/heretic_knowledge/mark/rust_mark
	name = "Mark of Rust"
	desc = "Теперь Хватка Мансуса накладывает Метку Ржавчины. Метка активируется при атаке Ржавым Клинком \
		вызывая у жертвы сильное недомогание и замешательство.  \
		Также позволяет ржаветь укреплённые стены, полы и пласталь."
	gain_text = "Кузнец устремил взгляд в давно забытые дали. \"Ржавые Холмы протянут руку помощи отчаявшимся... но готовься заплатить цену\""

/datum/heretic_knowledge/spell/rust_construction
	name = "Rust Construction"
	desc = "Дарует заклинание Rust Construction, позволяющее создать стену из проржавевшего пола. \
		Все, кто находится над местом постройки, будут отброшены (или подброшены вверх) и получат урон."
	gain_text = "Мой разум заполонили видения — странные, пугающие структуры, полностью покрытые слоями ржавчины. Они не просто перестали казаться рукотворными... \
		Возможно, ими они и не являлись изначально!"

/datum/heretic_knowledge/spell/area_conversion
	name = "Aggressive Spread"
	desc = "Дарует заклинание Aggressive Spread, которое переносит ржавчину на ближайшие поверхности. \
		Уже проржавевшие поверхности разрушаются. \ Также усиливает влияние на ржавчину у не ржавых еретиков."
	gain_text = "All wise men know well not to visit the Rusted Hills... Yet the Blacksmith's tale was inspiring."

/datum/heretic_knowledge/blade_upgrade/rust
	name = "Toxic Blade"
	desc = "Ваш Ржавый Клинок теперь вызывает отвращение у врагов при атаке \ Позволяет ржаветь Титан и Пластитан."
	gain_text = "Кузнец вручает тебе свой клинок. \"Меч проведёт тебя сквозь плоть… если ты позволишь\" \
		Ржавчина, густая как кровь, утяжеляет его. Взгляд тонет в потускневшей стали. Ржавые Холмы внемлют. Пришёл твой черёд."

/datum/heretic_knowledge/spell/entropic_plume
	name = "Entropic Plume"
	desc = "Дарует вам заклинание Entropic Plume — волну разъедающей ржавчины. \
		Ослепляет, отравляет и насылает «Безумие» на всех язычников, заставляя их без разбора атаковать друзей и врагов. \
		Также ржавчина разрушает любые поверхности, с которыми соприкасается, и усиливает способности ржавчины у тех еретиков, кто не обладает властью над ржавчиной."
	gain_text = "Коррозия была неудержима. Ржавчина — ненасытна. \
		Кузнец канул в небытие, а ты держишь его лезвие. Воин света… Будь готов — Ржавый Просветитель близок!"

/datum/heretic_knowledge/ultimate/rust_final
	name = "Rustbringer's Oath"
	desc = "Ритуал вознесения Пути Ржавчины. \
		Принесите 3 трупа на руну трансмутации что находится на мостике станции, чтобы завершить ритуал. \
		По завершении ритуал будет бесконечно распространять ржавчину, на любую поверхность не останавливаясь. \
		Кроме того, вы станете чрезвычайно устойчивыми находясь на ржавчине, восстанавливаюсь в три раза быстрее \
		и становясь невосприимчивым ко многим воздействиям и опасностям \
		Вы получите возможность покрыть ржавчиной все что только пожелаете."
	gain_text = "Чемпион ржавчины. Разрушитель стали. Трепещите перед тьмой - ибо РЖАВЫЙ КУЗНЕЦ пробудился! \
		ГРОХОТ НАКОВАЛЬНИ! ПРОКЛЯТЫЕ РУДНИКИ, ВОПИТЕ МОЁ ИМЯ! УЗРИТЕ МОЁ ВОСХОЖДЕНИЕ!"
	announcement_text = "%SPOOKY% Дрожите пред ржавчиной, ведь Ржавый Кузнец, %NAME% восстал! Ничто не избежит коррозии! %SPOOKY%"
	announcement_sound = 'modular_zzz/sound/heretic/rust_lore.ogg'


// ###############################################################################
// ############################©©#################################################
// ############################~.X#################=?#############################
// ###########################?.?.?##############N^^.ë############################
// ##########################±&£©'.~N#########æ£*@X±É@############################
// ##########################'I,´o..'N###æ?´....,íë@»?§###########################
// #########################£.I©~»&..í#£.............?Ñ###########################
// #########################/.;§&í.......~/............'æ#########################
// ########################Në~......'£Xí´.^É/©»..........o########################
// #######################Ñ´......&I........,»,@».........£#######################
// ######################@í.....%=...............o&.....í§;N######################
// #######################'...,@;Ñ=;;?Ñí....'§&^´'oN»....#######################
// #####################©@...»æ§»æ#,.í%/%..?±¶'~o~Ñ£»..~########################
// ###################¶;í@...ë#&§##*..'I£,.§?##N,..o^©@..I########################
// ################N&'''=©~.~%=£=###@»É~Ñ..Éí¶###XI£=Ñ£^^©IN######################
// #############Ñ;'''?ë^..@´I;.,§%^í;=Ñ?....XÑ»;=;*É;.=±Ñ%X~¶#####################
// ##############æí'ÑÉ?....§©´...I?IX'*&©#o¶=/ë='´.....´...±;íëN##################
// ################©*;o£É£^.......£;...........&,........;o§¶^''''I###############
// ###############§±±±±±?I©;......^É´.........I?.......¶~'''''''=©################
// #############£@±±±±±±æÉ?£ëí*£ëIí./ë@&//*ooí.í£@Ií~~?ë~'''^&¶###################
// ############£?=æ±±±¶@±±±o±Ñ'''''^I@ë£ëÉëÉX='''''''''''^¶#######################
// ############=???@§¶æÑë±±±±Ñ=''''~ÉÉÑÑÑÑÑÑ§§§æ?'''''''''~N######################
// ############¶Ñ±ëÉë±o??=§§±Éí'''o§ÑÉÑÑ§NÉÑÑ§§ÑÑÑ^''''''''=######################
// ############É?????@I????X©&'';æÑÑ¶ÉÑÑÑÑÑÑÑÑ©ÑÑÑæ&''''''''I#####################
// #############¶*??£±????=É=''±§ÑÑÑNæÑÑÑÑÑÑÑ§@oæÑÑÑÉ%############################
// #################ÑXX@¶É&^'»¶ÑÑ§§í*¶ÑÑÑÑ§§ÑÑ¶~'*¶ÑÑæ############################
// #####################XIX±©ÉÑæ@^^É§ÉÉ§§§§§§@±©ë¶í»¶É¶í.©########################
// #####################¶§*o?NX''&¶%%%%XXXX%%%%%o¶ë§É£...%########################
// #####################N,.I%£';¶£%%£§%%%±o%%%%æ%%Xæ=ÑN#¶#########################
// ########################Ño@/§§o%%X%%%%Ñ±%%%%%§ë%%ë±~N##########################
// #########################N*'ë#X.;&Xë@£%%%%%%%%£@±X´´;##########################
// ###########################¶###=.......**.......Ñ,´´Ñ##########################
// ################################I.......£......Xí´´´,±#########################
// #################################ë......£...../&´´´´´´'£#######################
// ##################################¶,....o,....©#I'´´´´´,;XN####################
// #############################§¶#©X;.....,;....'oN##############################
// ############################¶~......´=¶####æí....´..#########################
// ############################»....'£###########ë'...'Ñ##########################
// ##############################ë.?##############=.*É/#########################
// ###############################################################################
