/datum/interaction/lewd/thighs_penis
	name = "Захват бёдрами (С членом)"
	description = "Возьмите партнёра в ловушку бёдрами, кладя свои гениталии на его лицо."
	message = list(
		"наседает на лицо %TARGET%, закрывая какой-либо обзор.",
		"прижимает член к лицу %TARGET%, зажимая при этом между бёдер.",
		"слегка проскальзывает членом в рот %TARGET%, продолжая крепко сдавливать голову бёдрами."

	)

/datum/interaction/lewd/thighs_vagina
	name = "Захват бёдрами (С вагиной)"
	description = "Возьмите партнёра в ловушку бёдрами, вдавливая свою киску в его лицо."
	message = list(
		"наседает на лицо %TARGET%, закрывая какой-либо обзор.",
		"\"седлает\" лицо %TARGET%, растирая о него свою влажную киску.",
		"ёрзает своей киской по лицу %TARGET%, зажимая при этом бёдрами."
	)

/datum/interaction/lewd/thighfuck
	name = "Бёдра: трахнуть"
	description = "Насладитесь бёдрами партнёра довольно прямолинейным образом."
	cum_message_text_overrides = list(CLIMAX_POSITION_USER = list(
		"кончает поверх бёдер %TARGET%.",
		"стреляет семенем прямо поверх бёдер %TARGET%.",
		"покрывает бёдра %TARGET% горячей спермой."
	))
	cum_self_text_overrides = list(CLIMAX_POSITION_USER = list(
		"Вы кончаете поверх бёдер %TARGET%.",
		"Вы стреляете семенем прямо поверх бёдер %TARGET%.",
		"Вы покрываете бёдра %TARGET% горячей спермой."
	))
	cum_partner_text_overrides = list(CLIMAX_POSITION_USER = list(
		"%USER% кончает поверх ваших бёдер.",
		"%USER% стреляет семенем прямо поверх ваших бёдер.",
		"%USER% покрывает ваши бёдра горячей спермой."
	))
	message = list(
		"трахает бёдра %TARGET%, проскальзывая между них членом.",
		"скользит членом между бёдер %TARGET%.",
		"толкает таз навстречу бёдрам %TARGET%, проникая между ними.",
		"сношает междуножье %TARGET%."
	)
	user_messages = list(
		"Вы чувствуете горячие бёдра %TARGET%, сжимающие ваш член.",
		"Тепло междуножья %TARGET% ощущается просто отлично.",
		"Бёдра %TARGET% мягко обжимают ствол вашего члена."

	)
	target_messages = list(
		"Вы ощущаете член %USER% скользящим между ваших бёдер.",
		"Ствол члена %USER% трётся между ваших ног с лёгкой пульсацией.",
		"Член %USER% с теплом вдавливается в ваши бёдра."
	)

/datum/interaction/lewd/thighjob
	name = "Бёдра: \"оседлать\" партнёра"
	description = "Сделайте партнёру и его пенису приятно своими бёдрами."
	cum_message_text_overrides = list(CLIMAX_POSITION_TARGET = list(
		"кончает поверх бёдер %USER%.",
		"стреляет семенем прямо поверх бёдер %USER%.",
		"покрывает бёдра %USER% горячей спермой."
	))
	cum_self_text_overrides = list(CLIMAX_POSITION_TARGET = list(
		"%TARGET% кончает поверх ваших бёдер.",
		"%TARGET% стреляет семенем прямо поверх ваших бёдер.",
		"%TARGET% покрывает ваши бёдра горячей спермой."
	))
	cum_partner_text_overrides = list(CLIMAX_POSITION_TARGET = list(
		"Вы кончаете поверх бёдер %USER%.",
		"Вы стреляете семенем прямо поверх бёдер %USER%.",
		"Вы покрываете бёдра %USER% горячей спермой."
	))
	message = list(
		"сжимает член %TARGET% между своих бёдер.",
		"работает бёдрами над стволом члена %TARGET%, мягко сжимая его.",
		"удовлеворяет %TARGET% своими бёдрами.",
		"растирает член %TARGET% между своих ног."
	)
	user_messages = list(
		"Вы чувствуете, как член %TARGET% пульсирует между ваших бёдер.",
		"The warmth of %TARGET%'s shaft feels nice between your legs.",
		"You squeeze %TARGET%'s cock with your thighs."
	)
	target_messages = list(
		"Тёплые бёдра %USER% сжимают ваш член.",
		"Ваш член легко скользит между ножек %USER%.",
		"Мягкое междуножье %USER% ощущается бесподобно."
	)
